<html lang="fr" >
	<head>
		<link rel="stylesheet" type="text/css" href="main.css"/>
		<title>Présentation de l'équipe DALI</title>
		
		<meta content="equipe recherche, équipe recherche, dali, équipe dali equipe dali, informatique, webdali,
			 perpignan, upvd, universite, lirmm, laboratoire, 	Arithmetique des Ordinateurs, Nombres Flottants, Norme IEEE754,
			    Multiprecision, Operateurs Arithmetiques, Fonctions Elementaires,
			    Processeur Superscalaire, ILP, Cache de Trace, Predicteur
			    Multi-saut, Ordonnancement d'Instructions, Execution en
			    Desordre, Operateurs Cryptographiques, GPU, Manycore, Validation, Analyse Statique, Interpretation Abstraite" />
	</head>

	<body>	
	
		<div id="en_tete">
			<img src="DALI-logo.png" height="100px" style="padding-left: 10px; vertical-align: middle;"/>
<span style="padding-left:5px; display:inline-block; vertical-align: middle;"><font size="400%;" color="#000000 "><B>DALI</B></font><br>
<font color="#000000">Digits Architectures Logiciels Informatique</font>
</span>


<a href="http://www.lirmm.fr"><img src="LIRMM.png" height="75px" style="float: right; padding-right: 10px; padding-top:20px;"/></a>
<a href="http://www.univ-perp.fr"><img src="UPVD.png" height="75px" style="float: right; padding-right: 10px; padding-top:20px;"/></a>
		
		</div>

		<div id="corps">
		
		<div id="menu">
			
<html lang="fr" >
	

	<div id="menu">
		<div id="menutitre"><h4><a href="index.html">DALI</a></h4></div>
		<ul>
			<li>
				<a id="princp" href="presentation.html">Présentation</a>
					
			</li>

			<li>
				<a href="membres.html">Membres</a>
			</li>

			<li>
				<a href="publications.html">Publications</a>
					
			</li>

			<li>
				<a href="projets.html">Projets</a>
			</li>

			<li>
				<a href="logiciels.html">Logiciels</a>
			</li>
			
			<li>
				<a href="seminaires.html">Séminaires</a>
					
			</li>


			<li>
				<a href="contact.html">Contact</a>
					
			</li>

			<li>
				<a href="liens.html">Liens</a>
					
			</li>


		</ul>
	</div>
</html>		</div>
		
		<div id="contenu">
			<h1>Présentation</h1>
						
					    <h2>Mots clefs</h2>
					    <p>Arithmétique des Ordinateurs, Architecture, Micro-architecture des Processeurs,
						Simulation d'unités de calcul, Validation numérique, Analyse d'erreurs,
						Transformation sémantique de programmes, Analyse statique, Interprétation abstraite,
						Cryptographie, Calcul haute performance, Systèmes hybrides.</p>
			
						
				<h2>Thématique</h2>
				

                                <p>L'équipe DALI est constituée de 2 professeurs, 4 maîtres de conférences dont 2 HDR et 4 doctorants, post-doctorants ou ATER. </p>

                                <p>Les activités de DALI se structurent autour d'actions de recherche qui partagent l'objectif commun d'améliorer la qualité numérique et les performances du matériel comme du logiciel ainsi que la sécurité des opérateurs cryptographiques.</p>
				<div id="objdali">
				<table><tr><td align="center">
				<img src="daliObjectifs.png" align=middle width=500px/>
				</td></tr></table>
				</div>

				<p>L'équipe DALI développe une thématique de recherche unifiée afin d'améliorer la 
				qualité; numérique et la haute performance des calculs. DALI permet l'interaction, rare en France au sein d'une même équipe, d'experts en architecture et micro-architecture, simulation et compilation et arithm&eacute;tique des ordinateurs.</p>
				<p> C&ocirc;t&eacute; performances, nous nous intéressons plus particulièrement à la multiplication des coeurs (parall&eacute;lisme de t&acirc;ches) et &agrave; l'augmentation du parall&eacute;lisme d'instructions. La qualit&eacute; num&eacute;rique des applications de calcul scientifique et la s&ucirc;ret&eacute; de fonctionnement d'applications embarqu&eacute;es critiques d&eacute;pendent crucialement de la ma&icirc;trise des effets de la pr&eacute;cision finie des calculs-et de l'arithm&eacute;tique flottante en particulier. Il s'agit lors de contr&ocirc;ler et valider les calculs (algorithmes, codes) mais aussi d'am&eacute;liorer et optimiser la pr&eacute;cision num&eacute;rique des calculs et des r&eacute;sultats. Certaines applications, en calcul scientifique en particulier, n&eacute;cessitent d'am&eacute;liorer la qualit&eacute; num&eacute;rique des applications sans pour autant sacrifier la rapidit&eacute; de l'ex&eacute;cution. Ainsi se rejoignent am&eacute;lioration de la performance et de la qualit&eacute; num&eacute;rique. </p>
		
			
		   		
		
		
		</div>
		
		</div>		
	
	</body>
</html>		
